"use strict"
//  Операторы

let incr = 10,
    decr = 10;

// постфиксная форма
// incr++; //инкремент - увеличение на 1
// decr--; //декремент - уменьшение на 1

// префиксная форма
// ++incr;
// --decr;

console.log(incr++);// если используется сразу, то возвращает предыдущие значение
console.log(--decr);// префиксная форма возвращает измененное значение

console.log(5 % 2);//остаток от деления

console.log(2 * 8 == 16);// = - присваивание, == - єто сравнение

console.log(2*8 =="16");// true
console.log(2 * 8 === "16");// строгое сравнение - false

//Логические операторы
// && - и
// || - или
// ! - иотрицание


